Autodesk.Revit.UI.ExternalEvent.Raise
Instructing Revit to raise (signal) the external event.
Remarks:
Revit will wait until it is ready to process the event and then
it will execute its event handler by calling the Execute method.
Revit processes external events only when no other commands or
edit modes are currently active in Revit, which is the same policy
like the one that applies to evoking external commands.
Returns:
The result of event raising request. If the request is 'Accepted',
the event would be added to the event queue and its handler will
be executed in the next event-processing cycle.
Since:
2013

Autodesk.Revit.UI.ExternalEvent.CreateJournalable(Autodesk.Revit.UI.IExternalEventHandler)
Creates an instance of external event which will have the ability to record its executions in the journal.
handler:
An instance of IExternalEventHandler which will execute the event.
Returns:
An instance of ExternalEvent class, which will be used to invoke the event
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.ExternalEvent.Create(Autodesk.Revit.UI.IExternalEventHandler)
Creates an instance of external event.
handler:
An instance of IExternalEventHandler which will execute the event.
Returns:
An instance of ExternalEvent class, which will be used to invoke the event
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.UI.ExternalEvent.IsPending
Checking whether an event has been raised but not yet executed.
Remarks:
When an event is requested to raise it is not executed immediately;
instead, it waits for the next possible opportunity, which is determined
by various internal conditions in Revit (policy similar to invoking
external commands). When the opportunity comes, the event is executed
by calling the event's handler. In the meantime, the event is 'Pending'.
Since:
2013

Autodesk.Revit.UI.ExternalEvent
A class that represent an external event.
Remarks:
An instance if this class will be returned to an external event's owner upon the event's creation.
The event's owner will use this instance to signal that his application needs to be called by Revit.
Revit will periodically check if any of the events have been signaled (raised), and will execute
all events that were signaled (raised) by calling the Execute method on the events' respective handlers.
Since:
2013